#Петя, Катя и Сережа делают из бумаги журавликов.
#Вместе они сделали S журавликов. Сколько журавликов
#сделал каждый ребенок, если известно, что Петя и Сережа
#сделали одинаковое количество журавликов, а Катя сделала
#в два раза больше журавликов, чем Петя и Сережа вместе?
#Пример:
#6 -> 1  4  1
#24 -> 4  16  4
#60 -> 10  40  10



summ = int(input('Введите общее число журавликов: '))
peter = 0
serg = 0
summ > 0
kate = summ / 3 * 2
peter = kate / 2 / 2
serg = kate / 2 / 2
print(peter, kate, serg)

